# How to merge dataframes

## Suppose we have two dataframes as below

In [21]:
import pandas as pd
import random

In [22]:
# Merging the dataframe
df_1 = pd.DataFrame()
df_1['id'] = [i for i in range(1, 4)] + [7]
df_1['Name'] = ['A', 'B', 'C', 'K']
df_1

   id Name
0   1    A
1   2    B
2   3    C
3   7    K

In [23]:
df_2 = pd.DataFrame()
df_2['id'] = [i for i in range(1, 6)]
df_2['Sale'] = [random.randint(20, 50) for _ in range(5)]
df_2

   id  Sale
0   1    38
1   2    23
2   3    21
3   4    27
4   5    31

## Inner merge

In [24]:

pd.merge(df_1, df_2, on='id', how='inner')

   id Name  Sale
0   1    A    38
1   2    B    23
2   3    C    21

## Left merge

In [25]:

pd.merge(df_1, df_2, on='id', how='left')

   id Name  Sale
0   1    A  38.0
1   2    B  23.0
2   3    C  21.0
3   7    K   NaN

## Right merge

In [26]:

pd.merge(df_1, df_2, on='id', how='right')

   id Name  Sale
0   1    A    38
1   2    B    23
2   3    C    21
3   4  NaN    27
4   5  NaN    31

## Outter merge

In [27]:
pd.merge(df_1, df_2, on='id', how='outer')

   id Name  Sale
0   1    A  38.0
1   2    B  23.0
2   3    C  21.0
3   7    K   NaN
4   4  NaN  27.0
5   5  NaN  31.0

## Merge

In [28]:
pd.merge(df_1, df_2, on='id')

   id Name  Sale
0   1    A    38
1   2    B    23
2   3    C    21